fugreat/nrf52805_ble_uart/main.c
/*
{
    "t" : -20.6,
    "battery": 100,
    "type" : "S3"
}
*/

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT); /**< BLE NUS service instance. */
NRF_BLE_QWR_DEF(m_qwr);                           /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);               /**< Advertising module instance. */


/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = NULL,
        .len    = 0

    }
};

// const nrf_drv_timer_t TIMER_UART_RX = NRF_DRV_TIMER_INSTANCE(1);

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */


static void AT_cmd_handle(uint8_t *pBuffer, uint16_t length);
static uint8_t AT_cmd_check_valid(uint8_t *pBuffer, uint16_t length);


//对应int32大小的成员 的转换 范例 
int32_t swap_int32(int32_t value)
{
     return ((value & 0x000000FF) << 24) |
               ((value & 0x0000FF00) << 8) |
               ((value & 0x00FF0000) >> 8) |
               ((value & 0xFF000000) >> 24) ;
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for wdt feed timers.
 *
 * @details Starts application wdt feed timers.
 */
static void uart_timeout_timers_start(void)
{
    ret_code_t err_code;

    err_code = app_timer_start(m_uart_timeout_timer_id, UART_RX_DELAY_TIMEOUT, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for feed WDT.
 *
 * @param[in] p_context   Unused.
 */
static void uart_timeout_timer_handler(void *p_context)
{
    // start to dispatch
    app_timer_stop(m_uart_timeout_timer_id);

    NRF_LOG_HEXDUMP_INFO(UART_RX_BUF, UART_RX_STA);
    if (AT_cmd_check_valid(UART_RX_BUF, UART_RX_STA)) // AT command
    {
        NRF_LOG_INFO("Got AT");
        AT_cmd_handle(UART_RX_BUF, UART_RX_STA);
    }
    UART_RX_STA = 0;
}




/**@brief Function for wdt feed timers.
 *
 * @details Starts application wdt feed timers.
 */

/*
static void task_timeout_timers_start(void)
{
    ret_code_t err_code;
    err_code = app_timer_start(m_task_timeout_timer_id, TASK_TIMEOUT, NULL);
    APP_ERROR_CHECK(err_code);
}


static uint8_t counter = 0;
static void task_timeout_timer_handler(void *p_context)
{
    // NRF_LOG_INFO("RUN TASK");
    advertising_update();

}


static void task_timer_init(void){
    ret_code_t err_code;

    err_code = app_timer_create(&m_task_timeout_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                task_timeout_timer_handler);
    APP_ERROR_CHECK(err_code);
}
*/

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&m_uart_timeout_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                uart_timeout_timer_handler);
    APP_ERROR_CHECK(err_code);
    // task_timer_init();

}



/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t err_code;
    ble_gap_conn_params_t gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY)
                ;
        }
    }
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t err_code;
    ble_nus_init_t nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

