fugreat/nrf52805_ble_uart/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
    case BSP_EVENT_SLEEP:
        sleep_mode_enter();
        break;

    case BSP_EVENT_DISCONNECT:
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
        break;

    case BSP_EVENT_WHITELIST_OFF:
        if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            err_code = ble_advertising_restart_without_whitelist(&m_advertising);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
        }
        break;

    default:
        break;
    }
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t *p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t err_code;

    switch (p_event->evt_type)
    {
    case APP_UART_DATA_READY:
        UNUSED_VARIABLE(app_uart_get(&data_array[index]));
        index++;

        if ((data_array[index - 1] == '\n') ||
            (data_array[index - 1] == '\r') ||
            (index >= m_ble_nus_max_data_len))
        {
            if (index > 1)
            {
                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                NRF_LOG_HEXDUMP_DEBUG(data_array, index);

                do
                {
                    uint16_t length = (uint16_t)index;
                    err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                    if ((err_code != NRF_ERROR_INVALID_STATE) &&
                        (err_code != NRF_ERROR_RESOURCES) &&
                        (err_code != NRF_ERROR_NOT_FOUND))
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                } while (err_code == NRF_ERROR_RESOURCES);
            }

            index = 0;
        }
        break;

    case APP_UART_COMMUNICATION_ERROR:
        APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        break;
    }
}


static void advertising_init(void)
{

    // NRF_LOG_INFO("advertising_init");
    ret_code_t            err_code;

    // Set Tile default advertising parameters.
    memset(&g_adv_params, 0, sizeof(g_adv_params));

    g_adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    g_adv_params.duration        = APP_ADV_DURATION;
    g_adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    g_adv_params.p_peer_addr     = NULL;
    g_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;

    // Build and set Tile advertising data.
    memset(&g_advdata, 0, sizeof(g_advdata));

    g_advdata.name_type               = BLE_ADVDATA_NO_NAME;
    g_advdata.include_appearance      = false;
    g_advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    /* 定义制造商信息 */
    ble_advdata_manuf_data_t   manuf_specific_data;     /**< Manufacturer specific data. */
    /* 初始化清零 */ 
    memset(&manuf_specific_data, 0, sizeof(manuf_specific_data));
    /* 设置制造商参数 */
    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;
    
    manuf_specific_data.data.size = m_adv_manuf_data_size;
    manuf_specific_data.data.p_data = m_adv_manuf_data;
    g_advdata.p_manuf_specific_data = &manuf_specific_data;    

    /* Get current advertising data and params */
    // (void) tile_gap_get_adv_params(&adv_interval, &tile_service_uuid, &tile_service_data_length, tile_service_data, &manuf);

    g_adv_params.interval = APP_ADV_INTERVAL;

    m_adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;

    err_code = ble_advdata_encode(&g_advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &g_adv_params);
    APP_ERROR_CHECK(err_code);
}


/* Function to change Advertising data */
void advertising_update(void)
{
    // NRF_LOG_INFO("advertising_update");
    ret_code_t err_code;

    /* Stop Advertising, so as to enable it to be updated */
    err_code = sd_ble_gap_adv_stop(m_adv_handle);
    APP_ERROR_CHECK(err_code);
  
    /* Init Advertising data */ 
    advertising_init();

    /* Restart Advertising */
    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code); //����������

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t err_code;
      
    advertising_init();

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for check uart received data whether is AT cmd or Pass-through data.
 *
 * @param[in] pBuffer   pointer of string.
 * @param[in] length	Length of the data.
 *
 * @retval 1 AT command
 * @retval 0 Pass-through data
 */
static uint8_t AT_cmd_check_valid(uint8_t *pBuffer, uint16_t length)
{
    // check whether is AT cmd or not
    if (length < 2)
    {
        return 0;
    }

    if (strncmp((char *)pBuffer, "AT", 2) != 0)
    {
        return 0;
    }

    return 1;
}

