fugreat/nrf52805_ble_uart/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handler(app_uart_evt_t *p_event)
{
    switch (p_event->evt_type)
    {
    case APP_UART_DATA_READY:
        // nrf_drv_timer_disable(&TIMER_UART_RX);
        app_timer_stop(m_uart_timeout_timer_id);
        app_uart_get(&UART_RX_BUF[UART_RX_STA]);
        UART_RX_STA++; // Record the uart received data frame length
        uart_timeout_timers_start();
        break;

    case APP_UART_COMMUNICATION_ERROR:
        //APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        break;
    }
}
/**@snippet [Handling the data received over UART] */

#define MY_RX_PIN_NUMBER 20
#define MY_TX_PIN_NUMBER 14
#define MY_LED_PIN_NUMBER 0

 #define INIT_LED()   nrf_gpio_cfg_output(MY_LED_PIN_NUMBER)
 #define SET_LED()  nrf_gpio_pin_set(MY_LED_PIN_NUMBER)
 #define CLEAR_LED()  nrf_gpio_pin_clear(MY_LED_PIN_NUMBER)
 #define TOGGLE_LED()  nrf_gpio_pin_toggle(MY_LED_PIN_NUMBER)



// #define MY_RX_PIN_NUMBER 20
// #define MY_TX_PIN_NUMBER 14
/**@brief  Function for initializing the UART module.
 *
 * @param[in] baudrate   uart baudrate 
 *
 * @return NRF_SUCCESS on success, otherwise an error code.  
 */
/**@snippet [UART Initialization] */
static uint32_t uart_init(uint32_t baudrate)
{
    uint32_t err_code;
    app_uart_comm_params_t const comm_params =
        {
            .rx_pin_no = MY_RX_PIN_NUMBER,
            .tx_pin_no = MY_TX_PIN_NUMBER,
            .rts_pin_no = UART_PIN_DISCONNECTED,
            .cts_pin_no = UART_PIN_DISCONNECTED,
            .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
            .use_parity = false,
            .baud_rate = baudrate};

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handler,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    //    APP_ERROR_CHECK(err_code);
    return err_code;
}
/**@snippet [UART Initialization] */

/**@brief Function for convert Bluetooth MAC address to string.
 *
 * @param[in] pAddr   Bluetooth MAC address.
 * 
 * @return BD address as a string.
 */
char *Util_convertBdAddr2Str(uint8_t *pAddr)
{
    uint8_t charCnt;
    char hex[] = "0123456789ABCDEF";
    static char str[(BLE_GAP_ADDR_LEN << 1) + 1];
    char *pStr = str;

    // Start from end of addr
    pAddr += BLE_GAP_ADDR_LEN;

    for (charCnt = BLE_GAP_ADDR_LEN; charCnt > 0; charCnt--)
    {
        *pStr++ = hex[*--pAddr >> 4];
        *pStr++ = hex[*pAddr & 0x0F];
    }

    pStr = NULL;

    return str;
}

/*
uint8_t ad_data_dispatch(uint8_t *buf, uint8_t len, uint32_t *t_p, uint32_t *bat_p)
{
    if (buf == NULL || len < 5)
        return -1; // Frame invaild

    //
    char *delim = "+";
    char *p;
    // NRF_LOG_INFO("%s ", buf);

    p = strtok((char *)buf, delim); // 切 AT 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        NRF_LOG_INFO("STR1: %s", p);
    };

    p = strtok(NULL, delim); // 切 addr 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        NRF_LOG_INFO("STR2: %s",p);
    };

    p = strtok(NULL, delim); // 切  temperature 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        float v = atof(p)*10;
        *t_p = (uint32_t) v;
        NRF_LOG_INFO("STR3: %s %d", p, *t_p);

    };

    p = strtok(NULL, delim); // 切 battery 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        *bat_p = atoi(p);
        NRF_LOG_INFO("STR4:%s %d", p, *bat_p);

        return 0;
    }
    return -2;
}
*/


uint8_t ad_data_dispatch(uint8_t *buf, uint8_t len, char *t_p, char *bat_p)
{
    if (buf == NULL || len < 5)
        return -1; // Frame invaild

    //
    char *delim = "+";
    char *p;
    // NRF_LOG_INFO("%s ", buf);

    p = strtok((char *)buf, delim); // 切 AT 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        NRF_LOG_INFO("STR1: %s", p);
    };

    p = strtok(NULL, delim); // 切 addr 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        NRF_LOG_INFO("STR2: %s",p);
    };

    p = strtok(NULL, delim); // 切  temperature 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        strcpy(t_p, p);
        NRF_LOG_INFO("STR3: %s %s", p, t_p);

    };

    p = strtok(NULL, delim); // 切 battery 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        strcpy(bat_p, p);
        //bat_p = p;
        NRF_LOG_INFO("STR4:%s %s", p, bat_p);
        return 0;
    }
    return -2;
}


void _clear_tail(char *str){
    char *tmp = NULL;
    if ((tmp = strstr(str, "\r")))
    {
        *tmp = '\0';
    }
}

/**@brief Function for process AT command.
 *
 * @param[in] pBuffer   pointer of string.
 * @param[in] length	Length of the data.
 */
static void AT_cmd_handle(uint8_t *pBuffer, uint16_t length)
{
    ret_code_t err_code;
    // 移除AT前的无效字符

    // AT test: AT?\r\n
    if ((length == 5) && (strncmp((char *)pBuffer, "AT?\r\n", 5) == 0))
    {
        printf("AT:OK\r\n");
    } else if ((length == 10) && (strncmp((char *)pBuffer, "AT+BAUD8\r\n", 10) == 0))
    {
        printf("AT+BAUD8:OK\r\n");
        NRF_LOG_INFO("AT+BAUD8:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    }else if ((length == 13) && (strncmp((char *)pBuffer, "AT+STARTEN0\r\n", 13) == 0))
    {
        printf("AT+STARTEN0:OK\r\n");
        NRF_LOG_INFO("AT+STARTEN0:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    } else if ((length == 11) && (strncmp((char *)pBuffer, "AT+ADVIN0\r\n", 11) == 0))
    {
        printf("AT+ADVIN0:OK\r\n");
        NRF_LOG_INFO("AT+ADVIN0:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    } else if ((length == 11) && (strncmp((char *)pBuffer, "AT+ADVIN1\r\n", 11) == 0))
    {
        printf("AT+ADVIN1:OK\r\n");
        NRF_LOG_INFO("AT+ADVIN1:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    } else if ((length == 10) && (strncmp((char *)pBuffer, "AT+POWR0\r\n", 10) == 0))
    {
        printf("AT+POWR0:OK\r\n");
        NRF_LOG_INFO("AT+POWR0:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    }
     else if ((length == 14) && (strncmp((char *)pBuffer, "AT+NAME", 7) == 0))
    {

        printf("AT+NAMETH001:OK\r\n");
        NRF_LOG_INFO("AT+NAMETH001:OK\r\n");
        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    }

