fugreat/nrf52805_ble_uart/main.c
    // System soft reset: AT+RESET\r\n
    else if ((length == 8) && (strncmp((char *)pBuffer, "AT+RST\r\n", 8) == 0))
    {
       // NVIC_SystemReset(); // Restart the system by default
        printf("AT+RST:OK\r\n");
        NRF_LOG_INFO("AT+RST:OK\r\n");
    }

    else if ((length >= 10) && (strncmp((char *)pBuffer, "AT+NFTH", 7) == 0))
    {

        TOGGLE_LED();
        // 获取mac地址
        ble_gap_addr_t device_addr;
        #if (NRF_SD_BLE_API_VERSION >= 3)
        err_code = sd_ble_gap_addr_get(&device_addr);
        #else
        err_code = sd_ble_gap_address_get(&device_addr);
        #endif
        APP_ERROR_CHECK(err_code);
  
        // 准备数据结构
        char t_str[7] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
        char bat_str[5] = {0x00, 0x00, 0x00, 0x00, 0x00};

        // to do 解析出温度和电量
        int8_t res = ad_data_dispatch(pBuffer, length, t_str, bat_str);
        NRF_LOG_HEXDUMP_INFO(t_str, 7);
        NRF_LOG_HEXDUMP_INFO(bat_str, 5);
        
        if (res)
            return; // 解析不正确 直接退出
            
        if (err_code == NRF_SUCCESS)
        {
            printf("AT+NFTH:OK\r\n");
        }
        else
        {
            printf("AT+NFTH:FAIL\r\n");
        }
        
        memset((uint8_t *)m_adv_manuf_data, 0x00, sizeof(m_adv_manuf_data));
        strcat((char *)m_adv_manuf_data, "{\"t\":");
        _clear_tail(t_str);
        strcat((char *)m_adv_manuf_data, t_str);
        strcat((char *)m_adv_manuf_data, ",\"b\":");
        _clear_tail(bat_str);
        strcat((char *)m_adv_manuf_data, bat_str);
        strcat((char *)m_adv_manuf_data, "}");
        m_adv_manuf_data_size = strlen((char *)m_adv_manuf_data);
        NRF_LOG_INFO("MANF=%s Size=%d", m_adv_manuf_data, m_adv_manuf_data_size );
        if(m_adv_manuf_data_size < 20){ // 检验数据有效性
            advertising_update();
        }
    }
}

/**@brief Application main function.
 */

int main(void)
{
    // Initialize.

    INIT_LED();
    SET_LED();
    log_init();
    timers_init();
    uart_init(NRF_UARTE_BAUDRATE_115200);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Debug logging for UART over RTT started.");

    advertising_start();

    // task_timeout_timers_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}

/**
 * @}
 */
